podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/MCM_S32K14x.svd.xml
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1</dimIndex>
               <name>LMDR%s</name>
               <description>Local Memory Descriptor Register</description>
               <addressOffset>0x400</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>CF0</name>
                     <description>Control Field 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MT</name>
                     <description>Memory Type</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>SRAM_L</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>SRAM_U</description>
                           <value>0b001</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Writes to the LMDRn[7:0] are allowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Writes to the LMDRn[7:0] are ignored</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DPW</name>
                     <description>LMEM Data Path Width. This field defines the width of the local memory</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>010</name>
                           <description>LMEMn 32-bits wide</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>LMEMn 64-bits wide</description>
                           <value>0b011</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WY</name>
                     <description>Level 1 Cache Ways</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0000</name>
                           <description>No Cache</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>2-Way Set Associative</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>4-Way Set Associative</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LMSZ</name>
                     <description>LMEM Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0000</name>
                           <description>no LMEMn (0 KB)</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0001</name>
                           <description>1 KB LMEMn</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>2 KB LMEMn</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0011</name>
                           <description>4 KB LMEMn</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>8 KB LMEMn</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0101</name>
                           <description>16 KB LMEMn</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0110</name>
                           <description>32 KB LMEMn</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0111</name>
                           <description>64 KB LMEMn</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1000</name>
                           <description>128 KB LMEMn</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1001</name>
                           <description>256 KB LMEMn</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1010</name>
                           <description>512 KB LMEMn</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1011</name>
                           <description>1024 KB LMEMn</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1100</name>
                           <description>2048 KB LMEMn</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1101</name>
                           <description>4096 KB LMEMn</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1110</name>
                           <description>8192 KB LMEMn</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1111</name>
                           <description>16384 KB LMEMn</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LMSZH</name>
                     <description>LMEM Size Hole</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>LMEMn is a power-of-2 capacity</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>LMEMn is not a power-of-2, with a capacity is 0.75 * LMSZ</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>V</name>
                     <description>Local Memory Valid</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>LMEMn is not present</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>LMEMn is present</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>LMDR2</name>
               <description>Local Memory Descriptor Register2</description>
               <addressOffset>0x408</addressOffset>
               <resetValue>0x842440A0</resetValue>
               <fields>
                  <field>
                     <name>CF1</name>
                     <description>Control Field 1</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MT</name>
                     <description>Memory Type</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>010</name>
                           <description>PC Cache</description>
                           <value>0b010</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Writes to the LMDRn[7:0] are allowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Writes to the LMDRn[7:0] are ignored</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DPW</name>
                     <description>LMEM Data Path Width. This field defines the width of the local memory</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>010</name>
                           <description>LMEMn 32-bits wide</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>LMEMn 64-bits wide</description>
                           <value>0b011</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WY</name>
                     <description>Level 1 Cache Ways</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0000</name>
                           <description>No Cache</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>2-Way Set Associative</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>4-Way Set Associative</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LMSZ</name>
                     <description>LMEM Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>4 KB LMEMn</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LMSZH</name>
                     <description>LMEM Size Hole</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>LMEMn is a power-of-2 capacity</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>LMEMn is not a power-of-2, with a capacity is 0.75 * LMSZ</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>V</name>
                     <description>Local Memory Valid</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>LMEMn is not present</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>LMEMn is present</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>LMPECR</name>
               <description>LMEM Parity and ECC Control Register</description>
               <addressOffset>0x480</addressOffset>
               <fields>
                  <field>
                     <name>ERNCR</name>
                     <description>Enable RAM ECC Noncorrectable Reporting</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reporting disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reporting enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ERNCR" > <name>ER1BR</name> <description>Enable RAM ECC 1 Bit Reporting</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="ERNCR" > <name>ECPR</name> <description>Enable Cache Parity Reporting</description> <bitOffset>20</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>LMPEIR</name>
               <description>LMEM Parity and ECC Interrupt Register</description>
               <addressOffset>0x488</addressOffset>
               <fields>
                  <field>
                     <name>ENC</name>
                     <description>ENCn = ECC Noncorrectable Error n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>E1B</name>
                     <description>E1Bn = ECC 1-bit Error n</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PE</name>
                     <description>Cache Parity Error</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PEELOC</name>
                     <description>Parity or ECC Error Location</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Non-correctable ECC event from SRAM_L</description>
                           <value>0b00000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Non-correctable ECC event from SRAM_U</description>
                           <value>0b00001</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>V</name>
                     <description>Valid Bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>LMFAR</name>
               <description>LMEM Fault Address Register</description>
               <addressOffset>0x490</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EFADD</name>
                     <description>ECC Fault Address</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>LMFATR</name>
               <description>LMEM Fault Attribute Register</description>
               <addressOffset>0x494</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PEFPRT</name>
                     <description>Parity/ECC Fault Protection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PEFSIZE</name>
                     <description>Parity/ECC Fault Master Size</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>8-bit access</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>16-bit access</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>32-bit access</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>64-bit access</description>
                           <value>0b011</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PEFW</name>
                     <description>Parity/ECC Fault Write</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEFMST</name>
                     <description>Parity/ECC Fault Master Number</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overrun</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LMFDHR</name>
               <description>LMEM Fault Data High Register</description>
               <addressOffset>0x4A0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PEFDH</name>
                     <description>Parity or ECC Fault Data High</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>LMFDLR</name>
               <description>LMEM Fault Data Low Register</description>
               <addressOffset>0x4A4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PEFDL</name>
                     <description>Parity or ECC Fault Data Low</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
